In [ ]:
import sqlite3

In [ ]:
# creat connection
conn = sqlite3.connect('school.db')

cursor = conn.cursor()

In [ ]:
# create tables
cursor.execute('''CREATE TABLE IF NOT EXISTS employees (

id INTEGER PRIMARY KEY AUTOINCREMENT,

name TEXT,
               
last_name TEXT,

salary INTEGER,

department_id INTEGER

)''')

cursor.execute('''CREATE TABLE IF NOT EXISTS departments (

id INTEGER PRIMARY KEY AUTOINCREMENT,

name TEXT

)''')

In [ ]:
# Insert sample data

cursor.executemany('INSERT INTO employees (name, last_name, salary, department_id) VALUES (?, ?, ?, ?)', [

('Alice','Wayne', 2000, 1),

('Bob', 'cooper', 3000, 2),

('Charlie','Mcalister',4000, 3),

('Joey','Smith',6000, 2)

])

cursor.executemany('INSERT INTO departments (name) VALUES (?)', [
    ('Human Resources',),

    ('Finance',),

    ('Engineering',)
    
])

In [ ]:
# Task 1
cursor.execute(
"""SELECT e.id,e.last_name,e.salary 
FROM employees e
WHERE (salary BETWEEN 2000 AND 5000) 
AND (e.id NOT IN (101,200))""")

print(cursor.fetchall())

[(1, 'Wayne', 2000), (2, 'cooper', 3000), (3, 'Mcalister', 4000), (5, 'Wayne', 2000), (6, 'cooper', 3000), (7, 'Mcalister', 4000), (9, 'Wayne', 2000), (10, 'cooper', 3000), (11, 'Mcalister', 4000), (13, 'Wayne', 2000), (14, 'cooper', 3000), (15, 'Mcalister', 4000), (17, 'Wayne', 2000), (18, 'cooper', 3000), (19, 'Mcalister', 4000), (21, 'Wayne', 2000), (22, 'cooper', 3000), (23, 'Mcalister', 4000), (25, 'Wayne', 2000), (26, 'cooper', 3000), (27, 'Mcalister', 4000)]

In [ ]:
# Task2 
cursor.execute("""
SELECT e.name as employee_name, d.name as department_name 
FROM employees e JOIN departments d ON e.department_id = d.id
ORDER BY department_name ASC;
""")

print(cursor.fetchall())

[('Charlie', 'Engineering'), ('Charlie', 'Engineering'), ('Charlie', 'Engineering'), ('Charlie', 'Engineering'), ('Charlie', 'Engineering'), ('Charlie', 'Engineering'), ('Charlie', 'Engineering'), ('Bob', 'Finance'), ('Joey', 'Finance'), ('Bob', 'Finance'), ('Joey', 'Finance'), ('Bob', 'Finance'), ('Joey', 'Finance'), ('Bob', 'Finance'), ('Joey', 'Finance'), ('Bob', 'Finance'), ('Joey', 'Finance'), ('Bob', 'Finance'), ('Joey', 'Finance'), ('Bob', 'Finance'), ('Joey', 'Finance'), ('Alice', 'Human Resources'), ('Alice', 'Human Resources'), ('Alice', 'Human Resources'), ('Alice', 'Human Resources'), ('Alice', 'Human Resources'), ('Alice', 'Human Resources'), ('Alice', 'Human Resources')]

In [ ]:
# Task 3
cursor.execute("""
SELECT d.id as department_id, COUNT(e.id) as number_of_employees,AVG(salary) as avg_salary FROM
employees e JOIN departments d ON e.department_id = d.id 
GROUP BY d.id;
""")

print(cursor.fetchall())

[(1, 7, 2000.0), (2, 14, 4500.0), (3, 7, 4000.0)]